[
  {
    "slug": "how-long-does-cooked-chicken-last-in-the-fridge",
    "title": "How Long Does Cooked Chicken Last in the Fridge? A Practical Guide",
    "date": "2025-09-05",
    "excerpt": "A no-nonsense look at leftovers: storage times, safe reheating, and when to toss cooked chicken.",
    "tags": ["chicken", "leftovers", "fridge", "food-safety"],
    "contentHtml": "<p>Cooked chicken is one of the most common leftovers—and one of the most confusing. Is yesterday’s rotisserie or fried chicken safe for lunch? What about something you made on Sunday and forgot about until Thursday? In this guide we summarize clear, conservative timelines so you can make quick, confident decisions at home.</p><h3>Short answer</h3><p>In the refrigerator, cooked chicken is typically best within <strong>3–4 days</strong>. That window assumes the chicken was cooled quickly (ideally within two hours of cooking), stored in a shallow container, and held at or below <strong>40°F / 4°C</strong>. If the chicken sat out on the counter longer than two hours (one hour if above 90°F / 32°C), play it safe and discard it.</p><h3>Why the timeline matters</h3><p>Refrigeration slows bacterial growth, but it doesn’t stop it entirely. As time passes, the risk of pathogen growth increases and quality declines. Many people rely on smell alone, but odor changes can lag behind microbial growth. Time + temperature is a much better rule of thumb.</p><h3>Reheating for safety</h3><p>When you reheat leftovers, bring the thickest portion of the chicken to <strong>165°F / 74°C</strong>. That target helps you get past the danger zone quickly. If you don’t have a thermometer, reheat until piping hot and steaming throughout, then let it rest briefly so heat equalizes.</p><h3>Freezing for longer storage</h3><p>If you won’t eat the leftovers within 3–4 days, freeze them. Frozen, cooked chicken keeps food-safe <em>indefinitely</em>, though flavor and texture are best within a few months. Cool the food quickly, portion it, label with a date, and wrap well to minimize freezer burn. Thaw in the fridge, not on the counter.</p><h3>Common questions</h3><ul><li><strong>My chicken turned slightly gray—safe?</strong> Color isn’t a perfect indicator. Use the 3–4 day fridge rule and check smell and texture. If it’s slimy, tacky, or smells sour, discard it.</li><li><strong>What if it was brined or marinated?</strong> Seasoning doesn’t extend safety timelines.</li><li><strong>Can I refreeze cooked chicken?</strong> If it was thawed in the <em>refrigerator</em> and kept cold, you can refreeze, though quality may drop.</li></ul><p>For fast answers beyond chicken, use our <a href=\"/\" class=\"link\">home page quick check</a>—type a food, pick storage, and enter the time.</p><h3>Sources</h3><ul><li><a class=\"link\" href=\"https://www.foodsafety.gov\" target=\"_blank\">FoodSafety.gov</a></li><li><a class=\"link\" href=\"https://www.fsis.usda.gov/food-safety\" target=\"_blank\">USDA Food Safety and Inspection Service</a></li></ul>"
  },
  {
    "slug": "leftover-rice-safety-why-time-and-temperature-matter",
    "title": "Leftover Rice Safety: Why Time and Temperature Matter",
    "date": "2025-09-12",
    "excerpt": "Rice is convenient—but mishandled rice can cause illness. Here’s how to cool, store, and reheat safely.",
    "tags": ["rice", "leftovers", "room-temp", "reheating"],
    "contentHtml": "<p>Rice is a weeknight hero, but it also shows up in far too many food poisoning stories. The culprit is often <em>Bacillus cereus</em>, a spore-forming bacterium that can survive cooking and multiply rapidly when rice sits warm on the counter. The good news? With a few simple steps you can enjoy leftover rice safely.</p><h3>Cool quickly, store cold</h3><p>After cooking, spread rice in a shallow container so steam can escape and heat drops quickly. Aim to get it into the refrigerator within <strong>2 hours</strong>—faster is better. Keep your fridge at or below <strong>40°F / 4°C</strong>. Properly chilled, cooked rice is typically best within <strong>3–4 days</strong>.</p><h3>Don’t keep rice on the counter</h3><p>Leaving rice at room temperature invites trouble. The danger zone (40–140°F / 4–60°C) is where surviving spores can produce toxins. If rice was left out more than two hours (one hour in heat), it’s safer to discard it than to risk illness.</p><h3>Reheating the right way</h3><p>Reheat thoroughly to at least <strong>165°F / 74°C</strong>, stirring so heat reaches the center. If you microwave, add a spoonful of water and cover to generate steam; let it stand for a minute so heat equalizes. Do not reheat the same batch multiple times—portion what you’ll eat and keep the rest cold.</p><h3>Freezing rice</h3><p>Cook once, eat many times: portion rice into freezer bags, press flat, and freeze for quick future meals. Frozen rice remains safe indefinitely, though quality is best within a couple of months. Thaw in the fridge or reheat directly from frozen with a splash of water.</p><h3>Signs to toss</h3><p>If your rice smells off, looks unusually sticky and gummy, or has visible mold, it belongs in the bin. When in doubt, throw it out.</p><p>For other foods—pizza, chicken, sushi, cut fruit—use our <a href=\"/\" class=\"link\">quick check</a> to get instant timelines.</p><h3>Sources</h3><ul><li><a class=\"link\" href=\"https://www.foodsafety.gov\" target=\"_blank\">FoodSafety.gov</a></li><li><a class=\"link\" href=\"https://www.fsis.usda.gov/food-safety\" target=\"_blank\">USDA Food Safety and Inspection Service</a></li></ul>"
  },
  {
    "slug": "cut-fruit-safety-watermelon-cantaloupe-and-berries",
    "title": "Cut Fruit Safety: Watermelon, Cantaloupe, and Berries",
    "date": "2025-09-22",
    "excerpt": "Fresh fruit is fantastic—once it’s cut, handle it like any perishable. Here’s how to store it safely.",
    "tags": ["produce", "fruit", "watermelon", "berries", "fridge"],
    "contentHtml": "<p>Nothing beats cold, juicy fruit out of the fridge—until it turns mushy or questionable. Once fruit is cut, it moves from a stable, protected package into the world of perishable foods. That means the same time-and-temperature rules you use for leftovers should guide how you handle cut cantaloupe, watermelon, strawberries, blueberries, and more.</p><h3>Rinse, then cut</h3><p>Wash the <em>outside</em> of melons and berries under running water before you slice or hull them. For melons, scrub the rind with a clean brush. This keeps surface microbes from hitchhiking onto the edible portion.</p><h3>Refrigerate promptly</h3><p>Cut fruit should go into the refrigerator within <strong>2 hours</strong>—faster if possible. Store in a clean, covered container at or below <strong>40°F / 4°C</strong>. Most cut fruit is best within <strong>3–4 days</strong>; delicate berries may be closer to the 3-day mark, while firmer melon cubes can last a bit longer in top shape.</p><h3>Serving safely</h3><p>If you’re putting out a fruit platter, keep it chilled. Swap small trays frequently or nest the platter in ice. Discard anything that has sat out more than two hours (one if above 90°F / 32°C).</p><h3>Freezing fruit</h3><p>Freeze extra berries on a sheet tray before packing to keep them separate; use frozen fruit in smoothies, sauces, or baking. While freezing preserves safety indefinitely, quality is best within several months.</p><h3>Trust your senses—then the clock</h3><p>Sliminess, fermenty smells, or visible mold are all signs to toss. When in doubt, throw it out. For quick timelines on other foods, try the <a href=\"/\" class=\"link\">home page quick check</a>.</p><h3>Sources</h3><ul><li><a class=\"link\" href=\"https://www.foodsafety.gov\" target=\"_blank\">FoodSafety.gov</a></li><li><a class=\"link\" href=\"https://www.fda.gov/food\" target=\"_blank\">FDA Food</a></li></ul>"
  }
]
